---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeTypeWarning
source: html/91bda73b-c1e6-9ce6-0c5a-1cfc626a6ec4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeTypeWarning Property

The selected fitting(s) cannot maintain connections to existing fabrication parts due to size, direction or angle differences. You must manually reconnect the open connections.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricationPartCannotChangeTypeWarning { get; }
```